package org.example.search;

/**
 * packageName    : org.example.dfs
 * fileName       : BFS
 * author         : mac
 * date           : 10/22/24
 * description    :
 * ===========================================================
 * DATE              AUTHOR             NOTE
 * -----------------------------------------------------------
 * 10/22/24        mac       최초 생성
 */
//너비 우선 탐색
    //FIFO 탐색 , Queue 자료구조 이용
    //시간 복잡도 O(V + E)
    //탐색 시작 노드와 가까운 노드를 우선하여 탐색하므로 목표 노드에 도착하는 경로가 여러개 일때 최단 경로를 보장합니다.
    //인접리스트로 표현
//1 -> 2,3
//2 -> 5,6
//3 -> 4
//4 -> 6
//5 ->
//6 ->
public class BFS {
}
