package org.example.greedy;

/**
 * packageName    : org.example.greedy
 * fileName       : 그리디알고리즘
 * author         : mac
 * date           : 10/24/24
 * description    :
 * ===========================================================
 * DATE              AUTHOR             NOTE
 * -----------------------------------------------------------
 * 10/24/24        mac       최초 생성
 */
//현재 상태에서 보는 선택지중 최선의 선택지가 전체 선택지 중 최선의 선택지라고 가정하는 알고리즘이다.
    //최적의 해를 보장하지 않는다.

/**
 * 1.해선택 : 현재 상태에서 가장 최선이라고 생각되는 해를 선택한다.
 * 2.적절성 검사 : 현재 선택한 해가 전체 문제의 제약 조건에 벗어나지 않는지 검사한다.
 * 3. 해 검사: 현재까지 선택한 해 집합이 전체 문제를 해결할수 있는지 검사하낟. 전체 문제를 해결하지 못한다면 1로 돌가가 같은 과정을 반복한다.
 */
public class 그리디알고리즘 {
}
