package org.example.tree;

/**
 * packageName    : org.example.tree
 * fileName       : 트리잉노
 * author         : mac
 * date           : 11/7/24
 * description    :
 * ===========================================================
 * DATE              AUTHOR             NOTE
 * -----------------------------------------------------------
 * 11/7/24        mac       최초 생성
 */

/**
 * 트리에서 어떤 노드에서 다른노드로 가는 경로는 무조건 하나다.!
 * 트리의 특징:
 * 1. 순환 구조를 지니고 있지 않고, 1개의 루트 노드가 존재합니다.
 * 2. 루트 노드를 제외한 노드는 단 1개의 부모 노드를 갖습니다.
 * 3. 트리의 부분 트리 역시 트리의 모든 특징을 따릅니다.
 *
 * 팁 : 코딩테스트에서 tree가 나온다면,
 * 1. 그래프로 푸는 tree -> Node,Edge가 존재함 -> 인접리스트로도 표현 가능 -> DFS,BFS
 *
 * 2. tree만을 위한 문제 -> 이진트리 & 세그먼트트리 (index 트리) & LCA(최소공통조상)
 */
public class 트리이론 {

}
